from dadata import Dadata
import numpy as np
import pandas as pd
import tkinter as tk
from tkcalendar import DateEntry
import math


# Находим адрес по координатам
def find_address(lat, lon):
	token = '85a5aae7be99629991e7a750c8fe59e109d76d51'
	secret = '6b0e801a0e07c6fafbc19b5ba48d997f1f5c6e74'

	dadata = Dadata(token)
	try:
		return dadata.geolocate(name="address", lat=lat, lon=lon)[0]['value']
	except IndexError:
		return None


# Работа с Excel
def excel():
	df = pd.read_excel('TEST.xlsx', decimal=',')

	filtered_df = df.loc[(df['date_create'] >= date_1.get())
						& (df['date_create'] < date_2.get())]

	address = []

	for value in filtered_df.values:
		try:
			lon = value[5]
			lat = value[6]

			if cafe(lon, lat):
				address.append(cafe(lon, lat))
			else:
				address.append(find_address(lon, lat))
		except AttributeError:
			address.append('хз')

	pd.options.mode.chained_assignment = None
	filtered_df['Address'] = address

	filtered_df.to_excel("output.xlsx")


def cafe(lat, lon):
	data = {'проспект Дзержинского 126, Минск': (53.82934498198198, 53.86538101801802, 27.440352797596933, 27.501437202403064),
	 'Минск, ул. Гурского, 56': (53.85824198198198, 53.89427801801802, 27.464423695847916, 27.52555030415208),
	 'Минск, просп. Любимова, 17': (53.84114598198198, 53.87718201801802, 27.43251918449291, 27.493620815507086),
	 'Минск, ул. Одинцова 65': (53.881957981981984, 53.91799401801802, 27.410687349859977, 27.471848650140025),
	 'Минск, ул. Романовская Слобода, 8': (53.88475898198198, 53.92079501801802, 27.516992299549948, 27.57815770045005),
	 'Минск, ул. Притыцкого, 28А': (53.89189898198198, 53.92793501801802, 27.46568407155138, 27.526859928448623),
	 'Минск, Петра Глебки 5': (53.89083298198198, 53.92686901801802, 27.439597852233774, 27.500772147766227),
	 'Минск, ул. Притыцкого, 93': (53.88790498198198, 53.92394101801802, 27.40931799628763, 27.470488003712372),
	 'Минск, Боровлянский сельсовет, 74': (53.946424981981984, 53.98246101801802, 27.5933930722005, 27.6546489277995),
	 'Минск, ул. Сурганова 50/1': (53.91078698198198, 53.946823018018016, 27.556337230603706, 27.617540769396296),
	 'Минск, ул. М.Богдановича, 62': (53.90396898198198, 53.94000501801802, 27.538331228597556, 27.599524771402443),
	 'Минск, ул. Петра Мстиславца 11': (53.91567998198198, 53.95171601801802, 27.62192864247408, 27.683139357525917),
	 'Минск, пр-т Независимости, 179': (53.92830998198198, 53.96434601801802, 27.657447375733234, 27.718676624266763),
	 'Минск, ул.Гошкевича 3': (53.82212998198198, 53.85816601801802, 27.538247060522963, 27.59932093947704),
	 'Минск, пр-т Партизанский 87': (53.856479981981984, 53.89251601801802, 27.602666983588364, 27.663791016411636),
	 'Минск, ул. Денисовская, 8': (53.85359698198198, 53.88963301801802, 27.54228409030434, 27.60340390969566),
	 'Брест, ул. Советская 71': (52.07251498198198, 52.10855101801802, 23.664548542069767, 23.723199457930235),
	 'Брест, ул. Волгоградская 28а': (52.059559981981984, 52.09559601801802, 23.724574053459495, 23.783207946540504),
	 'Бобруйск, ул. Максима Горького, 6Б': (53.12606098198198, 53.16209701801802, 29.2006451985913, 29.260724801408703),
	 'Витебск, ул. Чкалова, 35': (55.14449198198198, 55.180528018018016, 30.17655565281223, 30.239638347187768),
	 'Гомель, ул. Ефремова, 11': (52.44080898198198, 52.47684501801802, 30.93554585370645, 30.994686146293546),
	 'Гомель, ул. Советская 2': (52.40801998198198, 52.44405601801802, 30.984436853252365, 31.043533146747638),
	 'Гомель, ул. Богдана Хмельницкого, 80А': (52.39475098198198, 52.430787018018016, 30.941802743944002, 31.000881256055997),
	 'Гродно, пр-т Космонавтов, 11': (53.656599981981984, 53.69263601801802, 23.823977176794944, 23.884810823205054),
	 'Гродно, пр-т Янки Купалы 82А': (53.63662498198198, 53.67266101801802, 23.819446590589447, 23.88025140941055),
	 'Гродно, пр-т Янки Купалы, 87': (53.631847981981984, 53.66788401801802, 23.82413903506186, 23.88493696493814),
	 'Жлобин, ул. Барташова, 15а': (52.88289698198198, 52.918933018018016, 30.009621045272148, 30.06936295472785),
	 'Могилев, пр-т Пушкинский, 41А': (53.85925598198198, 53.89529201801802, 30.307312954713648, 30.36844104528635),
	 'Могилев, ул. Космонавтов, 8': (53.89366498198198, 53.929701018018015, 30.28671577811476, 30.34789422188524),
	'Могилев, ул. Белинского 28': (53.91412198198198, 53.950158018018016, 30.320010785100532, 30.38121921489947),
	 'Молодечно, ул. Великий Гостинец, 143Б': (54.28060798198198, 54.31664401801802, 26.83561400293234, 26.89736599706766),
	 'Солигорск, ул. Железнодорожная 21А': (52.77436198198198, 52.81039801801802, 27.512262625357398, 27.5718553746426),
	 'Жодино, пр-т Ленина 22': (54.07951498198198, 54.11555101801802, 28.27504488176377, 28.33649711823623),
	'Лида, улица Качана, 29': (53.87892298198198, 53.91495901801802, 25.292291571063387, 25.353448428936616)}

	for add, crds in data.items():
		lat_min = crds[0]
		lat_max = crds[1]
		lon_min = crds[2]
		lon_max = crds[3]

		if lat_min <= lat <= lat_max and lon_min <= lon <= lon_max:
			return add
	return False


# GUI
if __name__ == '__main__':
	root = tk.Tk()

	root['bg'] = '#fafafa'
	root.title('Reverse Geocoding')
	root.wm_attributes('-alpha')

	root.resizable(width=False, height=False)

	tk.Label(root, text="Выберите временной диапазон", font='Roboto', background='#fafafa').grid()

	date_1 = DateEntry(root, locale='en_US', date_pattern="yyyy-mm-dd", font='Roboto')
	date_1.grid()

	date_2 = DateEntry(root, locale='en_US', date_pattern="yyyy-mm-dd", font='Roboto')
	date_2.grid()

	btn = tk.Button(root, text='Start', font='Roboto', command=excel, width=20)
	btn.grid(row=4, column=0)

	root.mainloop()